coin-selfservice-war/src/main/resources/lmngqueries/licenseForIdentityProvider.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <CrmAuthenticationToken xmlns="http://schemas.microsoft.com/crm/2007/WebServices">
      <AuthenticationType xmlns="http://schemas.microsoft.com/crm/2007/CoreTypes">0</AuthenticationType>
      <OrganizationName xmlns="http://schemas.microsoft.com/crm/2007/CoreTypes">SURFdienstenBV</OrganizationName>
      <CallerId xmlns="http://schemas.microsoft.com/crm/2007/CoreTypes">00000000-0000-0000-0000-000000000000</CallerId>
    </CrmAuthenticationToken>
  </soap:Header>
  <soap:Body>
    <Fetch xmlns="http://schemas.microsoft.com/crm/2007/WebServices">
      <fetchXml>
        &lt;fetch version="1.0" output-format="xml-platform" mapping="logical" distinct="true" page="1" count="1"&gt;
        &lt;entity name="account"&gt;
        &lt;attribute name="name"/&gt;
        &lt;attribute name="statuscode"/&gt;
        &lt;attribute name="accountid"/&gt;
        &lt;attribute name="websiteurl"/&gt;
        &lt;attribute name="surf_isinstelling"/&gt;
        &lt;attribute name="surf_ss_authentication_domain"/&gt;
        &lt;order attribute="name" descending="false"/&gt;
        &lt;link-entity name="lmng_licenseagreement" from="lmng_organisationid" to="accountid" alias="license"&gt;
        &lt;attribute name="lmng_number"/&gt;
        &lt;attribute name="lmng_validfrom"/&gt;
        &lt;attribute name="lmng_validto"/&gt;
        &lt;filter type="and"&gt;
        &lt;condition attribute="lmng_validfrom" operator="on-or-before" value="%VALID_ON%"/&gt;
        &lt;condition attribute="lmng_validto" operator="on-or-after" value="%VALID_ON%"/&gt;
        &lt;condition attribute="statuscode" operator="eq" value="4"/&gt;
        &lt;/filter&gt;
        &lt;link-entity name="lmng_productvariation" from="lmng_productvariationid" to="lmng_productvariationid" alias="productvariation"&gt;
        &lt;attribute name="lmng_name"/&gt;
        &lt;attribute name="lmng_description"/&gt;
        &lt;attribute name="lmng_deliverymethodid" /&gt;
        &lt;filter type="and"&gt;
        &lt;condition attribute="lmng_licensemodel" operator="eq" value="2"/&gt;
        &lt;/filter&gt;
        &lt;link-entity name="lmng_product" from="lmng_productid" to="lmng_productid" alias="product"&gt;
        &lt;attribute name="lmng_name"/&gt;
        &lt;attribute name="lmng_description"/&gt;
        &lt;attribute name="lmng_descriptionlong"/&gt;
        &lt;link-entity name="lmng_image" from="lmng_imageid" to="lmng_productimageid" alias="image" link-type="outer"&gt;
        &lt;attribute name="lmng_url"/&gt;
        &lt;/link-entity&gt;
        &lt;link-entity name="account" from="accountid" to="lmng_accountid" alias="supplier"&gt;
        &lt;attribute name="name"/&gt;
        &lt;/link-entity&gt;
        &lt;link-entity name="lmng_mediationagreement" from="lmng_mediationagreementid" to="lmng_mediationagreementid" alias="mediationagreement"&gt;
        &lt;filter type="and"&gt;
        &lt;condition attribute="lmng_agreementtype" operator="eq" value="1"/&gt;
        &lt;/filter&gt;
        &lt;/link-entity&gt;
        &lt;/link-entity&gt;
        &lt;/link-entity&gt;
        &lt;/link-entity&gt;
        &lt;link-entity name="contact" from="contactid" to="primarycontactid" visible="false" link-type="outer" alias="contact"&gt;
        &lt;attribute name="fullname"/&gt;
        &lt;attribute name="emailaddress1"/&gt;
        &lt;attribute name="jobtitle"/&gt;
        &lt;/link-entity&gt;
        &lt;/entity&gt;
        &lt;/fetch&gt;
      </fetchXml>
    </Fetch>
  </soap:Body>
</soap:Envelope>